Revit 2024 API
IndependentTag.CanLeaderEndConditionBeAssigned Method
 Checks whether the LeaderEndCondition can be changed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool CanLeaderEndConditionBeAssigned(
	LeaderEndCondition leaderEndCondition
)
Visual Basic
Public Function CanLeaderEndConditionBeAssigned ( _
	leaderEndCondition As LeaderEndCondition _
) As Boolean
Visual C++
public:
bool CanLeaderEndConditionBeAssigned(
	LeaderEndCondition leaderEndCondition
)
Parameters
leaderEndCondition
Type: Autodesk.Revit.DB.LeaderEndCondition
 The leader end condition to check.
Return Value
 True if the leader end condition of the tag can be assigned, or false otherwise.
Remarks
 Material tags and material keynotes can only use the free end condition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace